; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v1 ?v4)
             (pred_2 ?v5 ?v10)
             (pred_11 ?v1 ?v10)
             (pred_7 ?v13 ?v1 )
	     (pred_3 ?v1)
             (pred_9 ?v9)
             (pred_10 ?v5)
             (pred_1 ?v10)
             (pred_4 ?v1)
             (pred_8 ?v5)
             (pred_6 ?v1)
             (pred_12 ))



(:action op_4
:parameters (?v12 ?v6 ?v3 ?v2)
:precondition (and (pred_9 ?v12) (pred_9 ?v6) (pred_10 ?v3) (pred_1 ?v2)
          (pred_5 ?v12 ?v6) (pred_2 ?v3 ?v2)
                   (pred_11 ?v6 ?v2) (pred_3 ?v12) 
                   (pred_4 ?v6) (pred_8 ?v3))
:effect (and  (pred_6 ?v6) (not (pred_4 ?v6))))


(:action op_1
:parameters (?v12 ?v8)
:precondition (and (pred_9 ?v12) (pred_9 ?v8)
               (pred_3 ?v12) (pred_5 ?v12 ?v8) (pred_6 ?v8))
:effect (and (pred_3 ?v8) (not (pred_3 ?v12))))

(:action op_2
:parameters (?v12 ?v3)
:precondition (and (pred_9 ?v12) (pred_10 ?v3) 
                  (pred_3 ?v12) (pred_7 ?v3 ?v12) (pred_12 ))
:effect (and (pred_8 ?v3)
   (not (pred_7 ?v3 ?v12)) (not (pred_12 ))))


(:action op_5
:parameters (?v12 ?v11 ?v7)
:precondition (and (pred_9 ?v12) (pred_10 ?v11) (pred_10 ?v7)
                  (pred_3 ?v12) (pred_8 ?v7) (pred_7 ?v11 ?v12))
:effect (and (pred_8 ?v11) (pred_7 ?v7 ?v12)
        (not (pred_8 ?v7)) (not (pred_7 ?v11 ?v12))))

(:action op_3
:parameters (?v12 ?v3)
:precondition (and (pred_9 ?v12) (pred_10 ?v3) 
                  (pred_3 ?v12) (pred_8 ?v3))
:effect (and (pred_12 ) (pred_7 ?v3 ?v12) (not (pred_8 ?v3)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_07 obj_27 obj_09 obj_06 obj_21 obj_28 obj_24 obj_08 obj_25 obj_29 obj_10 obj_14 obj_23 obj_03 obj_13 obj_17 obj_16 obj_19 obj_15 obj_12 obj_02 obj_04 obj_30 obj_26 obj_05
    obj_11 obj_22 obj_18
    obj_31 obj_20 obj_01
    )

    (:init
       (pred_12)

       (pred_9 obj_07)
       (pred_9 obj_27)
       (pred_9 obj_09)
       (pred_9 obj_06)
       (pred_9 obj_21)
       (pred_9 obj_28)
       (pred_9 obj_24)
       (pred_9 obj_08)
       (pred_9 obj_25)
       (pred_9 obj_29)
       (pred_9 obj_10)
       (pred_9 obj_14)
       (pred_9 obj_23)
       (pred_9 obj_03)
       (pred_9 obj_13)
       (pred_9 obj_17)
       (pred_9 obj_16)
       (pred_9 obj_19)
       (pred_9 obj_15)
       (pred_9 obj_12)
       (pred_9 obj_02)
       (pred_9 obj_04)
       (pred_9 obj_30)
       (pred_9 obj_26)
       (pred_9 obj_05)
       (pred_1 obj_11)
       (pred_1 obj_22)
       (pred_1 obj_18)
       (pred_10 obj_31)
       (pred_10 obj_20)
       (pred_10 obj_01)

       (pred_5 obj_07 obj_28)
       (pred_5 obj_07 obj_27)
       (pred_5 obj_27 obj_24)
       (pred_5 obj_27 obj_09)
       (pred_5 obj_27 obj_07)
       (pred_5 obj_09 obj_08)
       (pred_5 obj_09 obj_06)
       (pred_5 obj_09 obj_27)
       (pred_5 obj_06 obj_25)
       (pred_5 obj_06 obj_21)
       (pred_5 obj_06 obj_09)
       (pred_5 obj_21 obj_29)
       (pred_5 obj_21 obj_06)
       (pred_5 obj_28 obj_10)
       (pred_5 obj_28 obj_24)
       (pred_5 obj_28 obj_07)
       (pred_5 obj_24 obj_14)
       (pred_5 obj_24 obj_08)
       (pred_5 obj_24 obj_27)
       (pred_5 obj_24 obj_28)
       (pred_5 obj_08 obj_23)
       (pred_5 obj_08 obj_25)
       (pred_5 obj_08 obj_09)
       (pred_5 obj_08 obj_24)
       (pred_5 obj_25 obj_03)
       (pred_5 obj_25 obj_29)
       (pred_5 obj_25 obj_06)
       (pred_5 obj_25 obj_08)
       (pred_5 obj_29 obj_13)
       (pred_5 obj_29 obj_21)
       (pred_5 obj_29 obj_25)
       (pred_5 obj_10 obj_17)
       (pred_5 obj_10 obj_14)
       (pred_5 obj_10 obj_28)
       (pred_5 obj_14 obj_16)
       (pred_5 obj_14 obj_23)
       (pred_5 obj_14 obj_24)
       (pred_5 obj_14 obj_10)
       (pred_5 obj_23 obj_19)
       (pred_5 obj_23 obj_03)
       (pred_5 obj_23 obj_08)
       (pred_5 obj_23 obj_14)
       (pred_5 obj_03 obj_15)
       (pred_5 obj_03 obj_13)
       (pred_5 obj_03 obj_25)
       (pred_5 obj_03 obj_23)
       (pred_5 obj_13 obj_12)
       (pred_5 obj_13 obj_29)
       (pred_5 obj_13 obj_03)
       (pred_5 obj_17 obj_02)
       (pred_5 obj_17 obj_16)
       (pred_5 obj_17 obj_10)
       (pred_5 obj_16 obj_04)
       (pred_5 obj_16 obj_19)
       (pred_5 obj_16 obj_14)
       (pred_5 obj_16 obj_17)
       (pred_5 obj_19 obj_30)
       (pred_5 obj_19 obj_15)
       (pred_5 obj_19 obj_23)
       (pred_5 obj_19 obj_16)
       (pred_5 obj_15 obj_26)
       (pred_5 obj_15 obj_12)
       (pred_5 obj_15 obj_03)
       (pred_5 obj_15 obj_19)
       (pred_5 obj_12 obj_05)
       (pred_5 obj_12 obj_13)
       (pred_5 obj_12 obj_15)
       (pred_5 obj_02 obj_04)
       (pred_5 obj_02 obj_17)
       (pred_5 obj_04 obj_30)
       (pred_5 obj_04 obj_16)
       (pred_5 obj_04 obj_02)
       (pred_5 obj_30 obj_26)
       (pred_5 obj_30 obj_19)
       (pred_5 obj_30 obj_04)
       (pred_5 obj_26 obj_05)
       (pred_5 obj_26 obj_15)
       (pred_5 obj_26 obj_30)
       (pred_5 obj_05 obj_12)
       (pred_5 obj_05 obj_26)
       (pred_4 obj_27)
       (pred_4 obj_13)
       (pred_4 obj_06)
       (pred_11  obj_27 obj_11)
       (pred_11  obj_13 obj_22)
       (pred_11  obj_06 obj_18)
       (pred_6 obj_07)
       (pred_6 obj_09)
       (pred_6 obj_21)
       (pred_6 obj_28)
       (pred_6 obj_24)
       (pred_6 obj_08)
       (pred_6 obj_25)
       (pred_6 obj_29)
       (pred_6 obj_10)
       (pred_6 obj_14)
       (pred_6 obj_23)
       (pred_6 obj_03)
       (pred_6 obj_17)
       (pred_6 obj_16)
       (pred_6 obj_19)
       (pred_6 obj_15)
       (pred_6 obj_12)
       (pred_6 obj_02)
       (pred_6 obj_04)
       (pred_6 obj_30)
       (pred_6 obj_26)
       (pred_6 obj_05)

       (pred_2  obj_31 obj_11)
       (pred_2  obj_20 obj_22)
       (pred_2  obj_01 obj_18)
       (pred_7 obj_31 obj_04)
       (pred_7 obj_20 obj_12)
       (pred_7 obj_01 obj_04)
       (pred_3 obj_09)
    )

    (:goal (and
       (pred_7 obj_31 obj_17)
    ))
(:constraints
  (always (not (pred_3 obj_16)))
)
)

; plan
1. (op_1 obj_09 obj_08)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_08)
   goals met: 0 of 1
2. (op_1 obj_08 obj_23)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_23)
   goals met: 0 of 1
3. (op_1 obj_23 obj_19)
   deleted: (pred_3 obj_23)
   added: (pred_3 obj_19)
   goals met: 0 of 1
4. (op_1 obj_19 obj_30)
   deleted: (pred_3 obj_19)
   added: (pred_3 obj_30)
   goals met: 0 of 1
5. (op_1 obj_30 obj_04)
   deleted: (pred_3 obj_30)
   added: (pred_3 obj_04)
   goals met: 0 of 1
6. (op_2 obj_04 obj_31)
   deleted: (pred_7 obj_31 obj_04) (pred_12)
   added: (pred_8 obj_31)
   goals met: 0 of 1
7. (op_1 obj_04 obj_02)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_02)
   goals met: 0 of 1
8. (op_1 obj_02 obj_17)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_17)
   goals met: 0 of 1
9. (op_3 obj_17 obj_31)
   deleted: (pred_8 obj_31)
   added: (pred_12) (pred_7 obj_31 obj_17)
   goals met: 1 of 1
